pok3r-custom/pok3r_re_firmware/unlocker/board/ht32/ht32f165x_reg.h
#ifndef HT32F165x_REG_H
#define HT32F165x_REG_H

#ifndef __IO
    #define __IO volatile
#endif

// Constants
// /////////////////////////////////////////////////////////////////////////////
#define AFIO_DEFAULT    0
#define AFIO_GPIO       1
#define AFIO_ADC        2
#define AFIO_CMP        3
#define AFIO_TM         4
#define AFIO_SPI        5
#define AFIO_USART      6
#define AFIO_I2C        7
#define AFIO_SMC        8
#define AFIO_EBI        9
#define AFIO_I2S        10
#define AFIO_OTHER      15

// Flash Memory Controller
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
  __IO uint32_t TADR;           //!< 0x000          Flash Target Address Register
  __IO uint32_t WRDR;           //!< 0x004          Flash Write Data Register
       uint32_t RESERVED0[1];   //!< 0x008          Reserved
  __IO uint32_t OCMR;           //!< 0x00C          Flash Operation Command Register
  __IO uint32_t OPCR;           //!< 0x010          Flash Operation Control Register
  __IO uint32_t OIER;           //!< 0x014          Flash Operation Interrupt Enable Register
  __IO uint32_t OISR;           //!< 0x018          Flash Operation Interrupt and Status Register
       uint32_t RESERVED1[1];   //!< 0x01C          Reserved
  __IO uint32_t PPSR[4];        //!< 0x020 ~ 0x02C  Flash Page Erase/Program Protection Status Register
  __IO uint32_t CPSR;           //!< 0x030          Flash Security Protection Status Register
       uint32_t RESERVED2[51];  //!< 0x034 ~ 0x0FC  Reserved
  __IO uint32_t VMCR;           //!< 0x100          Flash Vector Mapping Control Register
       uint32_t RESERVED3[31];  //!< 0x104 ~ 0x17C  Reserved
  __IO uint32_t MDID;           //!< 0x180          Manufacturer and Device ID Register
  __IO uint32_t PNSR;           //!< 0x184          Flash Page Number Status Register
  __IO uint32_t PSSR;           //!< 0x188          Flash Page Size Status Register
#if defined(HT32F165x)
       uint32_t RESERVED4[29];  //!< 0x18C ~ 0x1FC  Reserved
#else
  __IO uint32_t DID;            //!< 0x18C          Device ID Register
       uint32_t RESERVED4[28];  //!< 0x190 ~ 0x1FC  Reserved
#endif
  __IO uint32_t CFCR;           //!< 0x200          Flash Cache and Pre-fetch Control Register
       uint32_t RESERVED5[63];  //!< 0x204 ~ 0x2FC  Reserved
  __IO uint32_t SBVT[4];        //!< 0x300 ~ 0x30C  SRAM Booting Vector (4x32Bit)
#if defined(HT32F165x)
#else
  __IO uint32_t CID[4];         //!< 0x310 ~ 0x31C  Custom ID Register
#endif
} FMC_TypeDef;

#define FMC_OCMR_CMD_MASK           (0xF << 0)
#define FMC_OCMR_CMD_IDLE           (0x0 << 0)
#define FMC_OCMR_CMD_WORD_PROGRAM   (0x4 << 0)
#define FMC_OCMR_CMD_PAGE_ERASE     (0x8 << 0)
#define FMC_OCMR_CMD_MASS_ERASE     (0xA << 0)
#define FMC_OPCR_OPM_MASK           (0xF << 1)
#define FMC_OPCR_OPM_IDLE           (0x6 << 1)
#define FMC_OPCR_OPM_COMMIT         (0xA << 1)
#define FMC_OPCR_OPM_FINISHED       (0xE << 1)
#define FMC_CFCR_CE                 (1U << 12)
#define FMC_CFCR_WAIT_MASK          (7U << 0)
#define FMC_CFCR_WAIT_0             (1U)
#define FMC_CFCR_WAIT_1             (2U)
#define FMC_CFCR_WAIT_2             (3U)

// Power Control Unit
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
       uint32_t RESERVE0[64];
  __IO uint32_t BAKSR;          //!< 0x000          Status Register
  __IO uint32_t BAKCR;          //!< 0x004          Control Register
  __IO uint32_t BAKTEST;        //!< 0x008          Test Register
  __IO uint32_t HSIRCR;         //!< 0x00C          HSI Ready Counter Control Register
  __IO uint32_t LVDCSR;         //!< 0x010          Low Voltage/Brown Out Detect Control and Status Register
       uint32_t RESERVE1[59];   //!< 0x014 ~ 0x0FC  Reserved
  __IO uint32_t BAKREG[10];     //!< 0x100 ~ 0x124  Backup Register 0 ~ 9
} PWRCU_TypeDef;

// Clock Control Unit
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
  __IO uint32_t GCFGR;          //!< 0x000          Global Clock Configuration Register
  __IO uint32_t GCCR;           //!< 0x004          Global Clock Control Register
  __IO uint32_t GCSR;           //!< 0x008          Global Clock Status Register
  __IO uint32_t GCIR;           //!< 0x00C          Global Clock Interrupt Register
       uint32_t RESERVED0[2];   //!< 0x010 ~ 0x014  Reserved
  __IO uint32_t PLLCFGR;        //!< 0x018          PLL Configuration Register
  __IO uint32_t PLLCR;          //!< 0x01C          PLL Control Register
  __IO uint32_t AHBCFGR;        //!< 0x020          AHB Configuration Register
  __IO uint32_t AHBCCR;         //!< 0x024          AHB Clock Control Register
  __IO uint32_t APBCFGR;        //!< 0x028          APB Configuration Register
  __IO uint32_t APBCCR0;        //!< 0x02C          APB Clock Control Register 0
  __IO uint32_t APBCCR1;        //!< 0x030          APB Clock Control Register 1
  __IO uint32_t CKST;           //!< 0x034          Clock source status Register
#if defined(HT32F1653_4)
  __IO uint32_t APBPCSR0;       //!< 0x038          APB Peripheral Clock Selection Register 0
  __IO uint32_t APBPCSR1;       //!< 0x03C          APB Peripheral Clock Selection Register 1
  __IO uint32_t HSICR;          //!< 0x040          HSI Control Register
  __IO uint32_t HSIATCR;        //!< 0x044          HSI Auto Trimming Counter Register
#else
       uint32_t RESERVED1[4];   //!< 0x038 ~ 0x044  Reserved
#endif
       uint32_t RESERVED2[174]; //!< 0x048 ~ 0x2FC  Reserved
  __IO uint32_t LPCR;           //!< 0x300          Low Power Control Register
  __IO uint32_t MCUDBGCR;       //!< 0x304          MCU Debug Control Register
} CKCU_TypeDef;

#define CKCU_GCFGR_LPMOD_MASK       (7U << 29)
#define CKCU_GCFGR_USBPRE_MASK      (3U << 22)
#define CKCU_GCFGR_URPRE_MASK       (3U << 20)
#define CKCU_GCFGR_PLLSRC           (1U << 8)
#define CKCU_GCFGR_CKOUTSRC_MASK    (7U << 0)
#define CKCU_GCFGR_CKOUTSRC_CK_REF  (0U << 0)
#define CKCU_GCFGR_CKOUTSRC_CK_AHB  (1U << 0)
#define CKCU_GCFGR_CKOUTSRC_CK_SYS  (2U << 0)
#define CKCU_GCFGR_CKOUTSRC_CK_HSE  (3U << 0)
#define CKCU_GCFGR_CKOUTSRC_CK_HSI  (4U << 0)
#define CKCU_GCFGR_CKOUTSRC_CK_LSE  (5U << 0)
#define CKCU_GCFGR_CKOUTSRC_CK_LSI  (6U << 0)
#define CKCU_GCCR_PSRCEN            (1U << 17)
#define CKCU_GCCR_CKMEN             (1U << 16)
#define CKCU_GCCR_HSIEN             (1U << 11)
#define CKCU_GCCR_HSEEN             (1U << 10)
#define CKCU_GCCR_PLLEN             (1U << 9)
#define CKCU_GCCR_SW_MASK           (3U << 0)
#define CKCU_GCCR_SW_PLL            (1U << 0)
#define CKCU_GCCR_SW_HSE            (2U << 0)
#define CKCU_GCCR_SW_HSI            (3U << 0)
#define CKCU_GCSR_LSIRDY            (1U << 5)
#define CKCU_GCSR_LSERDY            (1U << 4)
#define CKCU_GCSR_HSIRDY            (1U << 3)
#define CKCU_GCSR_HSERDY            (1U << 2)
#define CKCU_GCSR_PLLRDY            (1U << 1)
#define CKCU_PLLCFGR_PFBD_MASK      (0x3fU << 23)
#define CKCU_PLLCFGR_POTD_MASK      (3U << 21)
#define CKCU_PLLCR_PLLBPS           (1U << 31)
#define CKCU_AHBCFGR_AHBPRE_MASK    (3U << 0)
#define CKCU_AHBCCR_PAEN            (1U << 16)
#define CKCU_AHBCCR_CRCEN           (1U << 13)
#define CKCU_AHBCCR_EBIEN           (1U << 12)
#define CKCU_AHBCCR_CKREFEN         (1U << 11)
#define CKCU_AHBCCR_USBEN           (1U << 10)
#define CKCU_APBCFGR_ADCDIV_MASK    (7U << 16)
#define CKCU_APBCCR0_I2SEN          (1U << 25)
#define CKCU_APBCCR0_SCIEN          (1U << 24)
#define CKCU_APBCCR0_EXTIEN         (1U << 15)
#define CKCU_APBCCR0_AFIOEN         (1U << 14)
#define CKCU_APBCCR0_UR1EN          (1U << 11)
#define CKCU_APBCCR0_UR0EN          (1U << 10)
#define CKCU_APBCCR0_USR1EN         (1U << 9)
#define CKCU_APBCCR0_USR0EN         (1U << 8)
#define CKCU_APBCCR0_SPI1EN         (1U << 5)
#define CKCU_APBCCR0_SPI0EN         (1U << 4)
#define CKCU_APBCCR0_I2C1EN         (1U << 1)
#define CKCU_APBCCR0_I2C0EN         (1U << 0)
#define CKCU_APBCCR1_ADCEN          (1U << 24)
#define CKCU_APBCCR1_OPA1EN         (1U << 23)
#define CKCU_APBCCR1_OPA0EN         (1U << 22)
#define CKCU_APBCCR1_BFTM1EN        (1U << 17)
#define CKCU_APBCCR1_BFTM0EN        (1U << 16)
#define CKCU_APBCCR1_GPTM1EN        (1U << 9)
#define CKCU_APBCCR1_GPTM0EN        (1U << 8)
#define CKCU_APBCCR1_BKPREN         (1U << 6)
#define CKCU_APBCCR1_WDTREN         (1U << 4)
#define CKCU_APBCCR1_MCTM1EN        (1U << 1)
#define CKCU_APBCCR1_MCTM0EN        (1U << 0)
#define CKCU_CKST_CKSWST_MASK       (3U << 30)
#define CKCU_CKST_HSIST_MASK        (7U << 24)
#define CKCU_CKST_HSEST_MASK        (3U << 16)
#define CKCU_CKST_PLLST_MASK        (0xfU << 8)
#define CKCU_LPCR_USBSLEEP          (1U << 8)
#define CKCU_LPCR_BKISO             (1U << 0)

// Reset Control Unit
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
  __IO uint32_t GRSR;           //!< 0x000          Global Reset Status Register
  __IO uint32_t AHBPRSTR;       //!< 0x004          AHB Peripheral Reset Register
  __IO uint32_t APBPRSTR0;      //!< 0x008          APB Peripheral Reset Register 0
  __IO uint32_t APBPRSTR1;      //!< 0x00C          APB Peripheral Reset Register 1
} RSTCU_TypeDef;

#define RSTCU_GRSR_PORSTF           (1U << 3)
#define RSTCU_GRSR_WDTRSTF          (1U << 2)
#define RSTCU_GRSR_EXTRSTF          (1U << 1)
#define RSTCU_GRSR_SYSRSTF          (1U << 0)
#define RSTCU_AHBPRSTR_PxRST(n)     ((1U << 8) << (n))
#define RSTCU_AHBPRSTR_CRCRST       (1U << 7)
#define RSTCU_AHBPRSTR_EBIRST       (1U << 6)
#define RSTCU_AHBPRSTR_USBRST       (1U << 5)
#define RSTCU_AHBPRSTR_DMARST       (1U << 0)
#define RSTCU_APBPRSTR0_I2SRST      (1U << 25)
#define RSTCU_APBPRSTR0_SCIRST      (1U << 24)
#define RSTCU_APBPRSTR0_EXTIRST     (1U << 15)
#define RSTCU_APBPRSTR0_AFIORST     (1U << 14)
#define RSTCU_APBPRSTR0_UR1RST      (1U << 11)
#define RSTCU_APBPRSTR0_UR0RST      (1U << 10)
#define RSTCU_APBPRSTR0_USR1RST     (1U << 9)
#define RSTCU_APBPRSTR0_USR0RST     (1U << 8)
#define RSTCU_APBPRSTR0_SPI1RST     (1U << 5)
#define RSTCU_APBPRSTR0_SPI0RST     (1U << 4)
#define RSTCU_APBPRSTR0_I2C1RST     (1U << 1)
#define RSTCU_APBPRSTR0_I2C0RST     (1U << 0)
#define RSTCU_APBPRSTR1_ADCRST      (1U << 24)
#define RSTCU_APBPRSTR1_OPA1RST     (1U << 23)
#define RSTCU_APBPRSTR1_OPA0RST     (1U << 22)
#define RSTCU_APBPRSTR1_BFTM1RST    (1U << 17)
#define RSTCU_APBPRSTR1_BFTM0RST    (1U << 16)
#define RSTCU_APBPRSTR1_GPTM1RST    (1U << 9)
#define RSTCU_APBPRSTR1_GPTM0RST    (1U << 8)
#define RSTCU_APBPRSTR1_WDTRST      (1U << 4)
#define RSTCU_APBPRSTR1_MCTM1RST    (1U << 1)
#define RSTCU_APBPRSTR1_MCTM0RST    (1U << 0)

