pok3r-custom/pok3r_re_firmware/unlocker/board/ht32/ht32f165x_reg.h
// General Purpose I/O
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
  __IO uint32_t DIRCR;          //!< 0x000          Data Direction Control Register
  __IO uint32_t INER;           //!< 0x004          Input function enable register
  __IO uint32_t PUR;            //!< 0x008          Pull-Up Selection Register
  __IO uint32_t PDR;            //!< 0x00C          Pull-Down Selection Register
  __IO uint32_t ODR;            //!< 0x010          Open Drain Selection Register
  __IO uint32_t DRVR;           //!< 0x014          Drive Current Selection Register
  __IO uint32_t LOCKR;          //!< 0x018          Lock Register
  __IO uint32_t DINR;           //!< 0x01c          Data Input Register
  __IO uint32_t DOUTR;          //!< 0x020          Data Output Register
  __IO uint32_t SRR;            //!< 0x024          Output Set and Reset Control Register
  __IO uint32_t RR;             //!< 0x028          Output Reset Control Register
} GPIO_TypeDef;

// Alternate Function Input/Output
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
  __IO uint32_t ESSR[2];        //!< 0x000 ~ 0x004  EXTI Source Selection Register 0 ~ 1
       uint32_t RESERVE0[6];    //!< 0x008 ~ 0x01C  Reserved
  union {
    struct {
  __IO uint32_t GPACFGR[2];     //!< 0x020 ~ 0x024  GPIO Port A Configuration Register 0 ~ 1
  __IO uint32_t GPBCFGR[2];     //!< 0x028 ~ 0x02C  GPIO Port B Configuration Register 0 ~ 1
  __IO uint32_t GPCCFGR[2];     //!< 0x030 ~ 0x034  GPIO Port C Configuration Register 0 ~ 1
  __IO uint32_t GPDCFGR[2];     //!< 0x038 ~ 0x03C  GPIO Port D Configuration Register 0 ~ 1
#if defined(HT32F1655_6)
  __IO uint32_t GPECFGR[2];     //!< 0x040 ~ 0x044  GPIO Port E Configuration Register 0 ~ 1
#endif
    };
    // alternate mapping
    struct {
  __IO uint32_t GPxCFGR[0][2];  //!< 0x020 ~ 0x044  GPIO Port x Configuration Register 0 ~ 1
    };
  };
} AFIO_TypeDef;

// Nested Vectored Interrupt Controller
// /////////////////////////////////////////////////////////////////////////////
// Implemented in Cortex-M3 Headers

// External Interrupt/Event Controller
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
  __IO uint32_t CFGR0;          //!< 0x000         EXTI Interrupt 0 Configuration Register
  __IO uint32_t CFGR1;          //!< 0x004         EXTI Interrupt 1 Configuration Register
  __IO uint32_t CFGR2;          //!< 0x008         EXTI Interrupt 2 Configuration Register
  __IO uint32_t CFGR3;          //!< 0x00C         EXTI Interrupt 3 Configuration Register
  __IO uint32_t CFGR4;          //!< 0x010         EXTI Interrupt 4 Configuration Register
  __IO uint32_t CFGR5;          //!< 0x014         EXTI Interrupt 5 Configuration Register
  __IO uint32_t CFGR6;          //!< 0x018         EXTI Interrupt 6 Configuration Register
  __IO uint32_t CFGR7;          //!< 0x01C         EXTI Interrupt 7 Configuration Register
  __IO uint32_t CFGR8;          //!< 0x020         EXTI Interrupt 8 Configuration Register
  __IO uint32_t CFGR9;          //!< 0x024         EXTI Interrupt 9 Configuration Register
  __IO uint32_t CFGR10;         //!< 0x028         EXTI Interrupt 10 Configuration Register
  __IO uint32_t CFGR11;         //!< 0x02C         EXTI Interrupt 11 Configuration Register
  __IO uint32_t CFGR12;         //!< 0x030         EXTI Interrupt 12 Configuration Register
  __IO uint32_t CFGR13;         //!< 0x034         EXTI Interrupt 13 Configuration Register
  __IO uint32_t CFGR14;         //!< 0x038         EXTI Interrupt 14 Configuration Register
  __IO uint32_t CFGR15;         //!< 0x03C         EXTI Interrupt 15 Configuration Register
  __IO uint32_t CR;             //!< 0x040         EXTI Interrupt Control Register
  __IO uint32_t EDGEFLGR;       //!< 0x044         EXTI Interrupt Edge Flag Register
  __IO uint32_t EDGESR;         //!< 0x048         EXTI Interrupt Edge Status Register
  __IO uint32_t SSCR;           //!< 0x04C         EXTI Interrupt Software Set Command Register
  __IO uint32_t WAKUPCR;        //!< 0x050         EXTI Interrupt Wakeup Control Register
  __IO uint32_t WAKUPPOLR;      //!< 0x054         EXTI Interrupt Wakeup Polarity Register
  __IO uint32_t WAKUPFLG;       //!< 0x058         EXTI Interrupt Wakeup Flag Register
} EXTI_TypeDef;

// Analog To Digital Converter
// /////////////////////////////////////////////////////////////////////////////

// Operational Amplifier / Comparator
// /////////////////////////////////////////////////////////////////////////////
#if defined(HT32F1653_4)
typedef struct {
  __IO uint32_t CR;             //!< 0x000          Comparator Control Register
  __IO uint32_t VALR;           //!< 0x004          Comparator Voltage Reference Register
  __IO uint32_t IER;            //!< 0x008          Comparator Interrupt Enable Register
  __IO uint32_t TFR;            //!< 0x00C          Comparator Transition Flag Register
} CMP_TypeDef;
#else
typedef struct {
  __IO uint32_t OPACR;          //!< 0x000          Operational Amplifier Control Register
  __IO uint32_t OFVCR;          //!< 0x004          Comparator Input Offset Voltage Cancellation Register
  __IO uint32_t CMPIER;         //!< 0x008          Comparator Interrupt Enable Register
  __IO uint32_t CMPRSR;         //!< 0x00C          Comparator Raw Status Register
  __IO uint32_t CMPISR;         //!< 0x010          Comparator Masked Interrupt Status Register
  __IO uint32_t CMPICLR;        //!< 0x014          Comparator Interrupt Clear Register
} OPACMP_TypeDef;
#endif

// Basic Function Timers
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
  __IO uint32_t CR;             //!< 0x000          Control Register
  __IO uint32_t SR;             //!< 0x004          Status Register
  __IO uint32_t CNTR;           //!< 0x008          Counter Value Register
  __IO uint32_t CMP;            //!< 0x00C          Compare Value Register
} BFTM_TypeDef;

