pok3r-custom/pok3r_re_firmware/unlocker/board/ht32/ht32f165x_reg.h
#define BFTM_CR_CEN                 (1U << 2)
#define BFTM_CR_OSM                 (1U << 1)
#define BFTM_CR_MIEN                (1U << 0)
#define BFTM_SR_MIF                 (1U << 0)

// General Purpose Timers
// Motor Control Timers
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
  __IO uint32_t CNTCFR;         //!< 0x000          Timer Counter Configuaration Register
  __IO uint32_t MDCFR;          //!< 0x004          Timer Mode Configuration Register
  __IO uint32_t TRCFR;          //!< 0x008          Timer Trigger Configuration Register
       uint32_t RESERVED0[1];   //!< 0x00C          Reserved
  __IO uint32_t CTR;            //!< 0x010          Timer Counter Register
       uint32_t RESERVED1[3];   //!< 0x014 ~ 0x01C  Reserved
  __IO uint32_t CHnICFR[4];     //!< 0x020 ~ 0x02C  Channel n Input Configuration Register
       uint32_t RESERVED2[4];   //!< 0x030 ~ 0x03C  Reserved
  __IO uint32_t CHnOCFR[4];     //!< 0x040 ~ 0x04C  Channel n Output Configuration Register
  __IO uint32_t CHCTR;          //!< 0x050          Channel Control Register
  __IO uint32_t CHPOLR;         //!< 0x054          Channel Polarity Control Register
       uint32_t RESERVED3[5];   //!< 0x058 ~ 0x068  Reserved
  // note: only available as MCTM
  __IO uint32_t CHBRKCFR;       //!< 0x06C          Channel Break Configuration Register
  __IO uint32_t CHBRKCTR;       //!< 0x070          Channel Break Control Register
  // end note
  __IO uint32_t DICTR;          //!< 0x074          Timer PDMA/Interrupt Control Register
  __IO uint32_t EVGR;           //!< 0x078          Timer Event Generator Register
  __IO uint32_t INTSR;          //!< 0x07C          Timer Interrupt Status Register
  __IO uint32_t CNTR;           //!< 0x080          Timer Counter Register
  __IO uint32_t PSCR;           //!< 0x084          Timer Prescaler Register
  __IO uint32_t CRR;            //!< 0x088          Timer Counter Reload Register
  // note: only available as MCTM
  __IO uint32_t REPR;           //!< 0x08C          Timer Repetition Register
  // end note
  __IO uint32_t CHnCCR[4];      //!< 0x090 ~ 0x09C  Channel n Capture/Compare Register
  __IO uint32_t CHnACR[4];      //!< 0x0A0 ~ 0x0AC  Channel n Asymmentric Compare Register
} TM_TypeDef;

#define TM_CNTCFR_CMSEL_MASK        (3U << 16)
#define TM_CNTCFR_CMSEL_MODE_3      (3U << 16)
#define TM_CNTCFR_CMSEL_MODE_2      (2U << 16)
#define TM_CNTCFR_CMSEL_MODE_1      (1U << 16)
#define TM_CNTCFR_CMSEL_MODE_0      (0U << 16)
#define TM_CTR_CHCCDS               (1U << 16)
#define TM_CTR_COMUS                (1U << 9)
#define TM_CTR_COMPRE               (1U << 8)
#define TM_CTR_CRBE                 (1U << 1)
#define TM_CTR_TME                  (1U << 0)
#define TM_CHnOCFR_CHnPRE           (1U << 4)
#define TM_CHnOCFR_REFnCE           (1U << 3)
#define TM_CHnOCFR_CHnOM(n)         ((((n)>>0)&7)|((((n)>>3)&1)<<8))
#define TM_CHBRKCTR_CHMOE           (1U << 4)

// Real Time Clock
// /////////////////////////////////////////////////////////////////////////////

// Watchdog Timer
// /////////////////////////////////////////////////////////////////////////////

// I2C
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
  __IO uint32_t CR;             //!< 0x000          Control Register
  __IO uint32_t IER;            //!< 0x004          Interrupt Enable Register
  __IO uint32_t ADDR;           //!< 0x008          Address Register
  __IO uint32_t SR;             //!< 0x00C          Status Register
  __IO uint32_t SHPGR;          //!< 0x010          SCL High Period Generation Register
  __IO uint32_t SLPGR;          //!< 0x014          SCL Low Period Generation Register
  __IO uint32_t DR;             //!< 0x018          Data Register
  __IO uint32_t TAR;            //!< 0x01C          Target Register
  __IO uint32_t ADDMR;          //!< 0x020          Address Mask Register
  __IO uint32_t ADDSR;          //!< 0x024          Address Snoop Register
  __IO uint32_t TOUT;           //!< 0x028          Timeout Register
} I2C_TypeDef;

#define I2C_CR_SEQ_FILTER_MASK      (3U << 14)
#define I2C_CR_SEQ_FILTER_2_PCLK    (2U << 14)
#define I2C_CR_SEQ_FILTER_1_PCLK    (1U << 14)
#define I2C_CR_SEQ_FILTER_DISABLE   (0U << 14)
#define I2C_CR_COMB_FILTER_En       (1U << 13)
#define I2C_CR_ENTOUT               (1U << 12)
#define I2C_CR_DMANACK              (1U << 10)
#define I2C_CR_RXDMAE               (1U << 9)
#define I2C_CR_TXDMAE               (1U << 8)
#define I2C_CR_ADRM                 (1U << 7)
#define I2C_CR_I2CEN                (1U << 3)
#define I2C_CR_GCEN                 (1U << 2)
#define I2C_CR_STOP                 (1U << 1)
#define I2C_CR_AA                   (1U << 0)
#define I2C_IER_RXBFIE              (1U << 18)
#define I2C_IER_TXDEIE              (1U << 17)
#define I2C_IER_RXDNEIE             (1U << 16)
#define I2C_IER_TOUTIE              (1U << 11)
#define I2C_IER_BUSERRIE            (1U << 10)
#define I2C_IER_RXNACKIE            (1U << 9)
#define I2C_IER_ARBLOSIE            (1U << 8)
#define I2C_IER_GCSIE               (1U << 3)
#define I2C_IER_ADRSIE              (1U << 2)
#define I2C_IER_STOIE               (1U << 1)
#define I2C_IER_STAIE               (1U << 0)
#define I2C_SR_TXNRX                (1U << 21)
#define I2C_SR_MASTER               (1U << 20)
#define I2C_SR_BUSBUSY              (1U << 19)
#define I2C_SR_RXBF                 (1U << 18)
#define I2C_SR_TXDE                 (1U << 17)
#define I2C_SR_RXDNE                (1U << 16)
#define I2C_SR_TOUTF                (1U << 11)
#define I2C_SR_BUSERR               (1U << 10)
#define I2C_SR_RXNACK               (1U << 9)
#define I2C_SR_ARBLOS               (1U << 8)
#define I2C_SR_GCS                  (1U << 3)
#define I2C_SR_ADRS                 (1U << 2)
#define I2C_SR_STO                  (1U << 1)
#define I2C_SR_STA                  (1U << 0)
#define I2C_TAR_RWD                 (1U << 10)

// SPI
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
  __IO uint32_t CR0;            //!< 0x000          Control Register 0
  __IO uint32_t CR1;            //!< 0x004          Control Register 1
  __IO uint32_t IER;            //!< 0x008          Interrupt Enable Register
  __IO uint32_t CPR;            //!< 0x00C          Clock Prescaler Register
  __IO uint32_t DR;             //!< 0x010          Data Register
  __IO uint32_t SR;             //!< 0x014          Status Register
  __IO uint32_t FCR;            //!< 0x018          FIFO Control Register
  __IO uint32_t FSR;            //!< 0x01C          FIFO Status Register
  __IO uint32_t FTOCR;          //!< 0x020          FIFO Time Out Counter Register
} SPI_TypeDef;

#define SPI_CR0_GUADTEN             (1U << 7)
#define SPI_CR0_DUALEN              (1U << 6)
#define SPI_CR0_SSELC               (1U << 4)
#define SPI_CR0_SELOEN              (1U << 3)
#define SPI_CR0_SPIEN               (1U << 0)
#define SPI_CR1_MODE                (1U << 14)
#define SPI_CR1_SELM                (1U << 13)
#define SPI_CR1_FIRSTBIT            (1U << 12)
#define SPI_CR1_SELAP               (1U << 11)
#define SPI_CR1_FORMAT_MASK         (7U << 8)
#define SPI_CR1_FORMAT_MODE0        (0x1U << 8)
#define SPI_CR1_FORMAT_MODE1        (0x2U << 8)
#define SPI_CR1_FORMAT_MODE2        (0x6U << 8)
#define SPI_CR1_FORMAT_MODE3        (0x5U << 8)
#define SPI_IER_RXBNEIEN            (1U << 2)
#define SPI_IER_TXBEIEN             (1U << 0)
#define SPI_SR_RXBNE                (1U << 2)
#define SPI_SR_TXE                  (1U << 1)
#define SPI_SR_TXBE                 (1U << 0)
#define SPI_FCR_FIFOEN              (1U << 10)
#define SPI_FSR_TXFS_MASK           (0xfU << 0)
#define SPI_FSR_RXFS_MASK           (0xfU << 4)

// USART
// UART
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
  union {
  __IO uint32_t RBR;            //!< 0x000          Receive Buffer Register
  __IO uint32_t TBR;            //!< 0x000          Transmit Holding Register
  __IO uint32_t DR;             //!< 0x000          Data Register
  };
  __IO uint32_t IER;            //!< 0x004          Interrupt Enable Register
  __IO uint32_t IIR;            //!< 0x008          Interrupt Identification Register/FIFO Control Register
  __IO uint32_t FCR;            //!< 0x00C          FIFO Control Register
  __IO uint32_t LCR;            //!< 0x010          Line Control Register
  // note: only available as USART
  __IO uint32_t MODCR;          //!< 0x014          Modem Control Register
  // end note
  __IO uint32_t LSR;            //!< 0x018          Line Status Register
  // note: only available as USART
  __IO uint32_t MODSR;          //!< 0x01C          Modem Status Register
  // end note
  __IO uint32_t TPR;            //!< 0x020          Timing Parameter Register
  __IO uint32_t MDR;            //!< 0x024          Mode Register
  // note: only available as USART
  __IO uint32_t IrDACR;         //!< 0x028          IrDA Control Register
  __IO uint32_t RS485CR;        //!< 0x02C          RS485 Control Register
  __IO uint32_t SYNCR;          //!< 0x030          Synchronous Control Register
  // end note
  __IO uint32_t FSR;            //!< 0x034          FIFO Status Register
  __IO uint32_t DLR;            //!< 0x038          Divisor Latch Register
       uint32_t RESERVED0;      //!< 0x03C          Reserved
  __IO uint32_t DEGTSTR;        //!< 0x040          Debug/Test Register
} USART_TypeDef;

