pok3r-custom/pok3r_re_firmware/unlocker/board/ht32/ht32f165x_reg.h
#define USART_FCR_FME               (1 << 0)
#define USART_FCR_RFR               (1 << 1)
#define USART_FCR_TFR               (1 << 2)
#define USART_FCR_TFTL_MASK         (0x3 << 4)
#define USART_FCR_TFTL_0BYTE        (0x0 << 4)
#define USART_FCR_TFTL_2BYTE        (0x1 << 4)
#define USART_FCR_TFTL_4BYTE        (0x2 << 4)
#define USART_FCR_TFTL_8BYTE        (0x3 << 4)
#define USART_FCR_RFTL_MASK         (0x3 << 6)
#define USART_FCR_RFTL_1BYTE        (0x0 << 6)
#define USART_FCR_RFTL_4BYTE        (0x1 << 6)
#define USART_FCR_RFTL_8BYTE        (0x2 << 6)
#define USART_FCR_RFTL_14BYTE       (0x3 << 6)
#define USART_FCR_URTXEN            (1 << 8)
#define USART_FCR_URRXEN            (1 << 9)
#define USART_LCR_WLS_MASK          (0x3 << 0)
#define USART_LCR_WLS_7BIT          (0x0 << 0)
#define USART_LCR_WLS_8BIT          (0x1 << 0)
#define USART_LCR_WLS_9BIT          (0x2 << 0)
#define USART_LCR_NSB               (1 << 2)
#define USART_LCR_PBE               (1 << 3)
#define USART_LCR_EPE               (1 << 4)
#define USART_LCR_SPE               (1 << 5)
#define USART_LCR_BCB               (1 << 6)
#define USART_LSR_RFDR              (1 << 0)
#define USART_LSR_OEI               (1 << 1)
#define USART_LSR_PEI               (1 << 2)
#define USART_LSR_FEI               (1 << 3)
#define USART_LSR_BII               (1 << 4)
#define USART_LSR_TXFEMPT           (1 << 5)
#define USART_LSR_TXEMPT            (1 << 6)
#define USART_LSR_ERRRX             (1 << 7)
#define USART_LSR_RSADDEF           (1 << 8)
#define USART_MDR_MODE_MASK         (0x3 << 0)
#define USART_MDR_MODE_NORMAL       (0x0 << 0)
#define USART_MDR_MODE_IRDA         (0x1 << 0)
#define USART_MDR_MODE_RS485        (0x2 << 0)
#define USART_MDR_MODE_SYNCHRONOUS  (0x3 << 0)
#define USART_MDR_TRSM              (1 << 2)
#define USART_MDR_TXDMAEN           (1 << 4)
#define USART_MDR_RXDMAEN           (1 << 5)

// Smart Card Interface
// /////////////////////////////////////////////////////////////////////////////

// USB
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
  __IO uint32_t CSR;            //!< 0x000          USB Control and Status Register
  __IO uint32_t IER;            //!< 0x004          USB Interrupt Enable Register
  __IO uint32_t ISR;            //!< 0x008          USB Interrupt Status Register
  __IO uint32_t FCR;            //!< 0x00C          USB Frame Count Register
  __IO uint32_t DEVAR;          //!< 0x010          USB Device Address Register
  struct {
    __IO uint32_t CSR;          //!< 0x014          USB Endpoint n Control and Status Register
    __IO uint32_t IER;          //!< 0x018          USB Endpoint n Interrupt Enable Register
    __IO uint32_t ISR;          //!< 0x01C          USB Endpoint n Interrupt Status Register
    __IO uint32_t TCR;          //!< 0x020          USB Endpoint n Transfer Count Register
    __IO uint32_t CFGR;         //!< 0x024          USB Endpoint n Configuration Register
  } EP[8];
} USB_TypeDef;

// USBCSR
#define USBCSR_FRES         (0x002)        // Force USB Reset Control
#define USBCSR_PDWN         (0x004)        // Power Down Mode Control
#define USBCSR_LPMODE       (0x008)        // Low-Power Mode Control
#define USBCSR_GENRSM       (0x020)        // Resume Request Generation Control
#define USBCSR_RXDP         (0x040)        // Received DP Line Status
#define USBCSR_RXDM         (0x080)        // Received DM Line Status
#define USBCSR_ADRSET       (0x100)        // Device Address Setting Control
#define USBCSR_SRAMRSTC     (0x200)        // USB SRAM Reset Condition
#define USBCSR_DPPUEN       (0x400)        // DP Pull Up Enable
#define USBCSR_DPWKEN       (0x800)        // DP Wake Up Enable

// USBIER
#define USBIER_UGIE         (0x0001)       // USB global Interrupt Enable
#define USBIER_SOFIE        (0x0002)       // Start Of Frame Interrupt Enable
#define USBIER_URSTIE       (0x0004)       // USB Reset Interrupt Enable
#define USBIER_RSMIE        (0x0008)       // Resume Interrupt Enable
#define USBIER_SUSPIE       (0x0010)       // Suspend Interrupt Enable
#define USBIER_ESOFIE       (0x0020)       // Expected Start Of Frame Enable
#define USBIER_EP0IE        (0x0100)       // Endpoint 0 Interrupt Enable
#define USBIER_EP1IE        (0x0200)       // Endpoint 1 Interrupt Enable
#define USBIER_EP2IE        (0x0400)       // Endpoint 2 Interrupt Enable
#define USBIER_EP3IE        (0x0800)       // Endpoint 3 Interrupt Enable
#define USBIER_EP4IE        (0x1000)       // Endpoint 4 Interrupt Enable
#define USBIER_EP5IE        (0x2000)       // Endpoint 5 Interrupt Enable
#define USBIER_EP6IE        (0x4000)       // Endpoint 6 Interrupt Enable
#define USBIER_EP7IE        (0x8000)       // Endpoint 7 Interrupt Enable

// USBISR
#define USBISR_SOFIF        (0x0002)       // Start Of Frame Interrupt Flag
#define USBISR_URSTIF       (0x0004)       // USB Reset Interrupt Flag
#define USBISR_RSMIF        (0x0008)       // Resume Interrupt Flag
#define USBISR_SUSPIF       (0x0010)       // Suspend Interrupt Flag
#define USBISR_ESOFIF       (0x0020)       // Expected Start Of Frame Interrupt
#define USBISR_EP0IF        (1U << 8)      // Endpoint 0 Interrupt Flag
#define USBISR_EP1IF        (1U << 9)      // Endpoint 1 Interrupt Flag
#define USBISR_EP2IF        (1U << 10)     // Endpoint 2 Interrupt Flag
#define USBISR_EP3IF        (1U << 11)     // Endpoint 3 Interrupt Flag
#define USBISR_EP4IF        (1U << 12)     // Endpoint 4 Interrupt Flag
#define USBISR_EP5IF        (1U << 13)     // Endpoint 5 Interrupt Flag
#define USBISR_EP6IF        (1U << 14)     // Endpoint 6 Interrupt Flag
#define USBISR_EP7IF        (1U << 15)     // Endpoint 7 Interrupt Flag
#define USBISR_EPnIF        (0xFF00)       // Endpoint Interrupt Mask

// USBFCR
#define USBFCR_FRNUM        (0x7FF)        // Frame Number
#define USBFCR_SOFLCK       (1U << 16)     // Start-of-Frame Lock Flag
#define USBFCR_LSOF         (0x3U << 17)   // Lost Start-of-Frame Number

// USBEPnCSR
#define USBEPnCSR_DTGTX     (0x01)         // Data Toggle Status, for IN transfer
#define USBEPnCSR_NAKTX     (0x02)         // NAK Status, for IN transfer
#define USBEPnCSR_STLTX     (0x04)         // STALL Status, for IN transfer
#define USBEPnCSR_DTGRX     (0x08)         // Data Toggle Status, for OUT transfer
#define USBEPnCSR_NAKRX     (0x10)         // NAK Status, for OUT transfer
#define USBEPnCSR_STLRX     (0x20)         // STALL Status, for OUT transfer

