pok3r-custom/pok3r_re_firmware/unlocker/board/ht32/ht32f165x_reg.h
// USBEPnIER
#define USBEPnIER_OTRXIE    (0x001)        // OUT Token Received Interrupt Enable
#define USBEPnIER_ODRXIE    (0x002)        // OUT Data Received Interrupt Enable
#define USBEPnIER_ODOVIE    (0x004)        // OUT Data Buffer Overrun Interrupt Enable
#define USBEPnIER_ITRXIE    (0x008)        // IN Token Received Interrupt Enable
#define USBEPnIER_IDTXIE    (0x010)        // IN Data Transmitted Interrupt Enable
#define USBEPnIER_NAKIE     (0x020)        // NAK Transmitted Interrupt Enable
#define USBEPnIER_STLIE     (0x040)        // STALL Transmitted Interrupt Enable
#define USBEPnIER_UERIE     (0x080)        // USB Error Interrupt Enable
#define USBEPnIER_STRXIE    (0x100)        // SETUP Token Received Interrupt Enable
#define USBEPnIER_SDRXIE    (0x200)        // SETUP Data Received Interrupt Enable
#define USBEPnIER_SDERIE    (0x400)        // SETUP Data Error Interrupt Enable
#define USBEPnIER_ZLRXIE    (0x800)        // Zero Length Data Received Interrupt Enable

// USBEPnISR
#define USBEPnISR_OTRXIF    (0x001)        // OUT Token Received Interrupt Flag
#define USBEPnISR_ODRXIF    (0x002)        // OUT Data Received Interrupt Flag
#define USBEPnISR_ODOVIF    (0x004)        // OUT Data Buffer Overrun Interrupt Flag
#define USBEPnISR_ITRXIF    (0x008)        // IN Token Received Interrupt Flag
#define USBEPnISR_IDTXIF    (0x010)        // IN Data Transmitted Interrupt Flag
#define USBEPnISR_NAKIF     (0x020)        // NAK Transmitted Interrupt Flag
#define USBEPnISR_STLIF     (0x040)        // STALL Transmitted Interrupt Flag
#define USBEPnISR_UERIF     (0x080)        // USB Error Interrupt Flag
#define USBEPnISR_STRXIF    (0x100)        // SETUP Token Received Interrupt Flag
#define USBEPnISR_SDRXIF    (0x200)        // SETUP Data Received Interrupt Flag
#define USBEPnISR_SDERIF    (0x400)        // SETUP Data Error Interrupt Flag
#define USBEPnISR_ZLRXIF    (0x800)        // Zero Length Data Received Interrupt Flag

// USBEPnTCR
#define USBEPnTCR_TCNT      (0x1FF)        // Transfer Byte Count

// USBEPnCFGR
#define USBEPnCFGR_EPEN     (1U << 31)     // Endpoint Enable
#define USBEPnCFGR_EPTYPE   (1U << 29)     // Transfer Type
#define USBEPnCFGR_EPDIR    (1U << 28)     // Transfer Direction
#define USBEPnCFGR_EPADR    (0xFU << 24)   // Endpoint Address
#define USBEPnCFGR_EPLEN    (0x7FU << 10)  // Buffer Length
#define USBEPnCFGR_EPBUFA   (0x3FF)        // Endpoint Buffer Address

// Peripheral Direct Memory Access
// /////////////////////////////////////////////////////////////////////////////

// Extend Bus Interface
// /////////////////////////////////////////////////////////////////////////////

// Inter-IC Sound
// /////////////////////////////////////////////////////////////////////////////

// CRC
// /////////////////////////////////////////////////////////////////////////////

#endif // HT32F165x_REG_H
